//SORTJOB  JOB (ACCT),'SORT & REMOVE DUPS',CLASS=A,MSGCLASS=A,NOTIFY=YOURID
//STEP01   EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=YOURID.INPUT.PS,DISP=SHR
//SORTOUT  DD DSN=YOURID.OUTPUT.PS,DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(1,1)),UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000)
//SYSIN    DD *
  SORT FIELDS=(13,8,CH,A)
  SUM FIELDS=NONE
/*
