//SORTJOB  JOB (ACCT),'SORT JOB',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//SORTSTEP EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=Z66845.INPUT.SORTIN,DISP=SHR
//SORTOUT  DD DSN=Z66845.OUTPUT.SORTOUT,DISP=(NEW,CATLG,DELETE),
//         SPACE=(CYL,1),UNIT=SYSDA,LRECL=80,RECFM=FB
//SYSIN    DD *
  SORT FIELDS=(13,8,CH,A)   //* Sorting based on key in columns 13-20
  SUM FIELDS=NONE           //* Remove duplicates
/*
//
